summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxSmu_regdef.h
/**
 * \file IfxSmu_regdef.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1585 $
 * $Date: 2013-09-03 13:30:24 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Smu Smu
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Smu_Bitfields Bitfields
 * \ingroup IfxLld_Smu
 * 
 * \defgroup IfxLld_Smu_union Union
 * \ingroup IfxLld_Smu
 * 
 * \defgroup IfxLld_Smu_struct Struct
 * \ingroup IfxLld_Smu
 * 
 */
#ifndef IFXSMU_REGDEF_H
#define IFXSMU_REGDEF_H
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Smu_Bitfields
 * \{  */

/** \\brief  SMU Access Enable Register 0 */
typedef struct _Ifx_SMU_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_SMU_ACCEN0_Bits;

/** \\brief  SMU Access Enable Register 1 */
typedef struct _Ifx_SMU_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_SMU_ACCEN1_Bits;

/** \\brief  Alarm Status Register */
typedef struct _Ifx_SMU_AD_Bits
{
    unsigned int DF0:1;                     /**< \brief [0:0] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF1:1;                     /**< \brief [1:1] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF2:1;                     /**< \brief [2:2] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF3:1;                     /**< \brief [3:3] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF4:1;                     /**< \brief [4:4] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF5:1;                     /**< \brief [5:5] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF6:1;                     /**< \brief [6:6] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF7:1;                     /**< \brief [7:7] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF8:1;                     /**< \brief [8:8] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF9:1;                     /**< \brief [9:9] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF10:1;                    /**< \brief [10:10] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF11:1;                    /**< \brief [11:11] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF12:1;                    /**< \brief [12:12] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF13:1;                    /**< \brief [13:13] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF14:1;                    /**< \brief [14:14] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF15:1;                    /**< \brief [15:15] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF16:1;                    /**< \brief [16:16] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF17:1;                    /**< \brief [17:17] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF18:1;                    /**< \brief [18:18] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF19:1;                    /**< \brief [19:19] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF20:1;                    /**< \brief [20:20] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF21:1;                    /**< \brief [21:21] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF22:1;                    /**< \brief [22:22] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF23:1;                    /**< \brief [23:23] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF24:1;                    /**< \brief [24:24] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF25:1;                    /**< \brief [25:25] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF26:1;                    /**< \brief [26:26] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF27:1;                    /**< \brief [27:27] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF28:1;                    /**< \brief [28:28] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF29:1;                    /**< \brief [29:29] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF30:1;                    /**< \brief [30:30] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
    unsigned int DF31:1;                    /**< \brief [31:31] Debug flag for alarm n belonging to alarm group x (x=0-6). (rh) */
} Ifx_SMU_AD_Bits;

